#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
Acquiring state lock. This may take a few moments...
module.iam_github_oidc_provider.data.tls_certificate.this[0]: Reading...
module.iam_github_oidc_provider.data.tls_certificate.this[0]: Read complete after 1s [id=43add1749d6d9832e0a8fca0784941273380c63a]
module.iam_github_oidc_role.data.aws_caller_identity.current: Reading...
module.ebs_csi_irsa.data.aws_partition.current: Reading...
module.company-example-eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.company-example-eks.data.aws_partition.current: Reading...
module.iam_github_oidc_provider.data.aws_partition.current: Reading...
data.aws_ami.eks_default: Reading...
module.ebs_csi_irsa.data.aws_region.current: Reading...
module.karpenter.data.aws_region.current: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.company-example-eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/company-example/cluster]
module.ebs_csi_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_github_oidc_provider.data.aws_partition.current: Read complete after 0s [id=aws]
module.company-example-eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.company-example-eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.ebs_csi_irsa.data.aws_region.current: Read complete after 0s [id=eu-west-1]
module.ebs_csi_irsa.data.aws_caller_identity.current: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
module.company-example-eks.data.aws_caller_identity.current: Reading...
module.karpenter.data.aws_caller_identity.current: Reading...
module.iam_github_oidc_role.data.aws_partition.current: Reading...
module.karpenter.data.aws_partition.current: Reading...
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.iam_github_oidc_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.company-example-vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01a268e4d3d7b316c]
module.company-example-eks.aws_iam_role.this[0]: Refreshing state... [id=company-example-cluster-20240526140818129700000003]
module.iam_github_oidc_provider.aws_iam_openid_connect_provider.this[0]: Refreshing state... [id=arn:aws:iam::381491846999:oidc-provider/token.actions.githubusercontent.com]
module.ebs_csi_irsa.data.aws_iam_policy_document.ebs_csi[0]: Reading...
module.ebs_csi_irsa.data.aws_iam_policy_document.ebs_csi[0]: Read complete after 0s [id=212299854]
module.ebs_csi_irsa.aws_iam_policy.ebs_csi[0]: Refreshing state... [id=arn:aws:iam::381491846999:policy/AmazonEKS_EBS_CSI_Policy-20240526140818137600000005]
module.iam_github_oidc_role.data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.iam_github_oidc_role.data.aws_iam_policy_document.this[0]: Reading...
module.iam_github_oidc_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3462691479]
module.karpenter.data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.company-example-eks.data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.company-example-eks.data.aws_iam_session_context.current: Reading...
module.company-example-eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::381491846999:user/jfotopoulos]
module.ebs_csi_irsa.data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.company-example-eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=company-example-cluster-20240526140818129700000003-20240526140820167800000008]
module.company-example-eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=company-example-cluster-20240526140818129700000003-20240526140819961000000007]
data.aws_ami.eks_default: Read complete after 1s [id=ami-00f34b6d2d1f002b0]
module.company-example-vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0668fd3e61cf78d7f]
module.company-example-vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-073ea1d095c1d8db1]
module.company-example-vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0bd55256e5252d20d]
module.company-example-vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07f22851d830f435d]
module.company-example-vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-04e794fd32c99af46]
module.company-example-vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0745f50aae781c12e]
module.company-example-vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-05663c52d5d4c64fc]
module.company-example-vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0eb27470455662799]
module.company-example-vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-098ecf95df9c37eff]
module.company-example-eks.aws_security_group.node[0]: Refreshing state... [id=sg-0b835d20568501027]
module.company-example-vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ef79faeb5b8ccd97]
module.company-example-vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0dfaa05abe8c9d383]
module.company-example-vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0bbf03405f1bb9fe9]
module.company-example-eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0f324dca11191a7d5]
module.company-example-vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00f2f53ec46e8b643]
module.company-example-vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-073ea1d095c1d8db11080289494]
module.company-example-vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=company-example-vpc]
module.company-example-vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0e69db9cc36bf8cc9]
module.company-example-vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0c080284c5b096c7c]
module.company-example-vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-014ed34499d20070f]
module.company-example-vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f580824ef0149b15]
module.company-example-vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0b3804b29a8fcb725]
module.company-example-vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ce2cb797c2db4354]
module.company-example-vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0224b072fb1e7fdac]
module.company-example-vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0031ba91382867896]
module.company-example-vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-04f6269caca9edfd6]
module.company-example-eks.aws_security_group_rule.cluster["ingress_allow_vpc_to_kube_api"]: Refreshing state... [id=sgrule-3848115912]
module.company-example-eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3952633035]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-485650806]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1206717726]
module.company-example-eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2027269127]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-859637569]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1420898623]
module.company-example-eks.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-1318118290]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2393860744]
module.company-example-eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1380719475]
module.company-example-eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-806355700]
module.company-example-eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3700035560]
module.company-example-eks.aws_security_group_rule.node["egress_everywhere_allICMP"]: Refreshing state... [id=sgrule-2891853179]
module.company-example-eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1541692896]
module.company-example-eks.aws_security_group_rule.node["egress_vpc_all"]: Refreshing state... [id=sgrule-4231728787]
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Reading...
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.company-example-vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0c50f5fb4d75c4dcc]
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=karpenter-eks-node-group-20240526140826167600000009]
module.company-example-eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=381491846999]
module.company-example-vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0668fd3e61cf78d7f1080289494]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=karpenter-eks-node-group-20240526140826167600000009-2024052614082698090000000b]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=karpenter-eks-node-group-20240526140826167600000009-2024052614082701550000000c]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=karpenter-eks-node-group-20240526140826167600000009-2024052614082685450000000a]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=karpenter-eks-node-group-20240526140826167600000009-2024052614082714020000000d]
module.company-example-eks.aws_eks_cluster.this[0]: Refreshing state... [id=company-example]
module.company-example-eks.data.tls_certificate.this[0]: Reading...
module.company-example-eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-0a0a7731891ba57c5,Project]
module.company-example-eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0a0a7731891ba57c5,Environment]
module.company-example-eks.time_sleep.this[0]: Refreshing state... [id=2024-05-26T14:19:15Z]
module.company-example-eks.module.eks_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=1625193542130577152]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-0a1a0e78ea25f88d5]
module.company-example-eks.module.eks_managed_node_group["karpenter"].aws_eks_node_group.this[0]: Refreshing state... [id=company-example:karpenter-20240526141917315300000014]
module.company-example-eks.data.tls_certificate.this[0]: Read complete after 0s [id=585e5ff420479566f6257ba376c39b1343ba13d5]
module.company-example-eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::381491846999:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/05364FAF23496F008C33A4C46AC3F23D]
module.ebs_csi_irsa.data.aws_iam_policy_document.this[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.ebs_csi_irsa.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1969163404]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=1643244019]
module.ebs_csi_irsa.aws_iam_role.this[0]: Refreshing state... [id=ebs-csi]
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-2024052614184615110000000f]
module.ebs_csi_irsa.aws_iam_role_policy_attachment.ebs_csi[0]: Refreshing state... [id=ebs-csi-20240526141846891900000010]
module.company-example-eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.company-example-eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.company-example-eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.company-example-eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.company-example-eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 1s [id=kube-proxy]
module.company-example-eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 1s [id=aws-ebs-csi-driver]
module.company-example-eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 1s [id=vpc-cni]
module.company-example-eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 1s [id=coredns]
module.company-example-eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=company-example:coredns]
module.company-example-eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=company-example:aws-ebs-csi-driver]
module.company-example-eks.aws_eks_addon.before_compute["vpc-cni"]: Refreshing state... [id=company-example:vpc-cni]
module.company-example-eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=company-example:kube-proxy]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.company-example-eks.aws_eks_access_entry.this["Admins"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "company-example"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = (known after apply)
      + tags              = {
          + "Environment" = "dev"
          + "Project"     = "Karpenter"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Owner"       = "company-example"
          + "Project"     = "Karpenter"
          + "Terraform"   = "true"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.company-example-eks.aws_eks_access_policy_association.this["Admins_first"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "company-example"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = (known after apply)

      + access_scope {
          + type = "cluster"
        }
    }

  # module.iam_github_oidc_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRoleWithWebIdentity",
                        ]
                      + Condition = {
                          + "ForAllValues:StringEquals" = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              + "token.actions.githubusercontent.com:iss" = "https://token.actions.githubusercontent.com"
                            }
                          + StringLike                  = {
                              + "token.actions.githubusercontent.com:sub" = "repo:StaybullTech/karpenter-iac:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::381491846999:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = "GithubOidcAuth"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "company-example-eks-admin"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "company-example"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.iam_github_oidc_role.aws_iam_role_policy_attachment.this["EKSClusterAdminPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + role       = "company-example-eks-admin"
    }

  # module.karpenter.data.aws_iam_policy_document.controller[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "controller" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ec2:CreateFleet",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "arn:aws:ec2:*:*:launch-template/*",
              + "arn:aws:ec2:*:*:security-group/*",
              + "arn:aws:ec2:*:*:spot-instances-request/*",
              + "arn:aws:ec2:*:*:subnet/*",
              + "arn:aws:ec2:*::image/*",
              + "arn:aws:ec2:*::snapshot/*",
            ]
          + sid       = "AllowScopedEC2InstanceActions"
        }
      + statement {
          + actions   = [
              + "ec2:CreateFleet",
              + "ec2:CreateLaunchTemplate",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "arn:aws:ec2:*:*:fleet/*",
              + "arn:aws:ec2:*:*:instance/*",
              + "arn:aws:ec2:*:*:launch-template/*",
              + "arn:aws:ec2:*:*:network-interface/*",
              + "arn:aws:ec2:*:*:spot-instances-request/*",
              + "arn:aws:ec2:*:*:volume/*",
            ]
          + sid       = "AllowScopedEC2InstanceActionsWithTags"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "owned",
                ]
              + variable = "aws:RequestTag/kubernetes.io/cluster/company-example"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "*",
                ]
              + variable = "aws:RequestTag/karpenter.sh/nodepool"
            }
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
            ]
          + resources = [
              + "arn:aws:ec2:*:*:fleet/*",
              + "arn:aws:ec2:*:*:instance/*",
              + "arn:aws:ec2:*:*:launch-template/*",
              + "arn:aws:ec2:*:*:network-interface/*",
              + "arn:aws:ec2:*:*:spot-instances-request/*",
              + "arn:aws:ec2:*:*:volume/*",
            ]
          + sid       = "AllowScopedResourceCreationTagging"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "RunInstances",
                  + "CreateFleet",
                  + "CreateLaunchTemplate",
                ]
              + variable = "ec2:CreateAction"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "owned",
                ]
              + variable = "aws:RequestTag/kubernetes.io/cluster/company-example"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "*",
                ]
              + variable = "aws:RequestTag/karpenter.sh/nodepool"
            }
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
            ]
          + resources = [
              + "arn:aws:ec2:*:*:instance/*",
            ]
          + sid       = "AllowScopedResourceTagging"

          + condition {
              + test     = "ForAllValues:StringEquals"
              + values   = [
                  + "karpenter.sh/nodeclaim",
                  + "Name",
                ]
              + variable = "aws:TagKeys"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "owned",
                ]
              + variable = "aws:ResourceTag/kubernetes.io/cluster/company-example"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "*",
                ]
              + variable = "aws:ResourceTag/karpenter.sh/nodepool"
            }
        }
      + statement {
          + actions   = [
              + "ec2:DeleteLaunchTemplate",
              + "ec2:TerminateInstances",
            ]
          + resources = [
              + "arn:aws:ec2:*:*:instance/*",
              + "arn:aws:ec2:*:*:launch-template/*",
            ]
          + sid       = "AllowScopedDeletion"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "owned",
                ]
              + variable = "aws:ResourceTag/kubernetes.io/cluster/company-example"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "*",
                ]
              + variable = "aws:ResourceTag/karpenter.sh/nodepool"
            }
        }
      + statement {
          + actions   = [
              + "ec2:DescribeAvailabilityZones",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstanceTypeOfferings",
              + "ec2:DescribeInstanceTypes",
              + "ec2:DescribeInstances",
              + "ec2:DescribeLaunchTemplates",
              + "ec2:DescribeSecurityGroups",
              + "ec2:DescribeSpotPriceHistory",
              + "ec2:DescribeSubnets",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "AllowRegionalReadActions"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "eu-west-1",
                ]
              + variable = "aws:RequestedRegion"
            }
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:eu-west-1::parameter/aws/service/*",
            ]
          + sid       = "AllowSSMReadActions"
        }
      + statement {
          + actions   = [
              + "pricing:GetProducts",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "AllowPricingReadActions"
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowInterruptionQueueActions"
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowPassingInstanceRole"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ec2.amazonaws.com",
                ]
              + variable = "iam:PassedToService"
            }
        }
      + statement {
          + actions   = [
              + "iam:CreateInstanceProfile",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "AllowScopedInstanceProfileCreationActions"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "eu-west-1",
                ]
              + variable = "aws:RequestTag/topology.kubernetes.io/region"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "owned",
                ]
              + variable = "aws:RequestTag/kubernetes.io/cluster/company-example"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "*",
                ]
              + variable = "aws:RequestTag/karpenter.k8s.aws/ec2nodeclass"
            }
        }
      + statement {
          + actions   = [
              + "iam:TagInstanceProfile",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "AllowScopedInstanceProfileTagActions"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "eu-west-1",
                ]
              + variable = "aws:ResourceTag/topology.kubernetes.io/region"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "owned",
                ]
              + variable = "aws:RequestTag/kubernetes.io/cluster/company-example"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "owned",
                ]
              + variable = "aws:ResourceTag/kubernetes.io/cluster/company-example"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "*",
                ]
              + variable = "aws:RequestTag/karpenter.k8s.aws/ec2nodeclass"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "*",
                ]
              + variable = "aws:ResourceTag/karpenter.k8s.aws/ec2nodeclass"
            }
        }
      + statement {
          + actions   = [
              + "iam:AddRoleToInstanceProfile",
              + "iam:DeleteInstanceProfile",
              + "iam:RemoveRoleFromInstanceProfile",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "AllowScopedInstanceProfileActions"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "eu-west-1",
                ]
              + variable = "aws:ResourceTag/topology.kubernetes.io/region"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "owned",
                ]
              + variable = "aws:ResourceTag/kubernetes.io/cluster/company-example"
            }
          + condition {
              + test     = "StringLike"
              + values   = [
                  + "*",
                ]
              + variable = "aws:ResourceTag/karpenter.k8s.aws/ec2nodeclass"
            }
        }
      + statement {
          + actions   = [
              + "iam:GetInstanceProfile",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "AllowInstanceProfileReadActions"
        }
      + statement {
          + actions   = [
              + "eks:DescribeCluster",
            ]
          + resources = [
              + "arn:aws:eks:eu-west-1:381491846999:cluster/company-example",
            ]
          + sid       = "AllowAPIServerEndpointDiscovery"
        }
    }

  # module.karpenter.data.aws_iam_policy_document.queue[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "queue" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "SqsWrite"

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                  + "sqs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["health_event"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - AWS health event"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "AWS Health Event",
                ]
              + source      = [
                  + "aws.health",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "KarpenterHealthEvent-"
      + tags           = {
          + "ClusterName" = "company-example"
          + "Environment" = "dev"
        }
      + tags_all       = {
          + "ClusterName" = "company-example"
          + "Environment" = "dev"
          + "Owner"       = "company-example"
          + "Terraform"   = "true"
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - EC2 instance rebalance recommendation"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "EC2 Instance Rebalance Recommendation",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "KarpenterInstanceRebalance-"
      + tags           = {
          + "ClusterName" = "company-example"
          + "Environment" = "dev"
        }
      + tags_all       = {
          + "ClusterName" = "company-example"
          + "Environment" = "dev"
          + "Owner"       = "company-example"
          + "Terraform"   = "true"
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - EC2 instance state-change notification"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "EC2 Instance State-change Notification",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "KarpenterInstanceStateChange-"
      + tags           = {
          + "ClusterName" = "company-example"
          + "Environment" = "dev"
        }
      + tags_all       = {
          + "ClusterName" = "company-example"
          + "Environment" = "dev"
          + "Owner"       = "company-example"
          + "Terraform"   = "true"
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - EC2 spot instance interruption warning"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "EC2 Spot Instance Interruption Warning",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "KarpenterSpotInterrupt-"
      + tags           = {
          + "ClusterName" = "company-example"
          + "Environment" = "dev"
        }
      + tags_all       = {
          + "ClusterName" = "company-example"
          + "Environment" = "dev"
          + "Owner"       = "company-example"
          + "Terraform"   = "true"
        }
    }

  # module.karpenter.aws_cloudwatch_event_target.this["health_event"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_eks_access_entry.node[0] will be created
  + resource "aws_eks_access_entry" "node" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "company-example"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = (known after apply)
      + tags              = {
          + "Environment" = "dev"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Owner"       = "company-example"
          + "Terraform"   = "true"
        }
      + type              = "EC2_LINUX"
      + user_name         = (known after apply)
    }

  # module.karpenter.aws_iam_policy.controller[0] will be created
  + resource "aws_iam_policy" "controller" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Karpenter controller IAM policy"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "KarpenterController-"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Owner"       = "company-example"
          + "Terraform"   = "true"
        }
    }

  # module.karpenter.aws_iam_role.node[0] will be created
  + resource "aws_iam_role" "node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "Karpenter-company-example-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "company-example"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.controller[0] will be created
  + resource "aws_iam_role_policy_attachment" "controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "KarpenterController-2024052614184615110000000f"
    }

  # module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "node" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "node" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "node" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "node_additional" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.karpenter.aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 300
      + name                              = "Karpenter-company-example"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags                              = {
          + "Environment" = "dev"
        }
      + tags_all                          = {
          + "Environment" = "dev"
          + "Owner"       = "company-example"
          + "Terraform"   = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.karpenter.aws_sqs_queue_policy.this[0] will be created
  + resource "aws_sqs_queue_policy" "this" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + eks-cluster-endpoint          = "https://05364FAF23496F008C33A4C46AC3F23D.sk1.eu-west-1.eks.amazonaws.com"
  + karpenter-node-role-arn       = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/artifacts/plan-output.txt

To perform exactly these actions, run the following command to apply:
    tofu apply "/tmp/artifacts/plan-output.txt"

```

</details>

*Pusher: @johnf-staybull, Action: `pull_request`, Working Directory: ``, Workflow: `OpenTofu Setup WorkFlow`*